<a href="https://colab.research.google.com/github/Sudhanshu1304/Pandas-Library/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. What is Pandas ??

2. Why do we need it ??

3. Basic Commands needed ??

# **Pandas Library**

### Basic Commends to Know in Pandas
***
<br>

These are some of the basic commands in pandas which are frequently needed,

and are also helpfull in Data preprocessing 
<br>

**data = pd.read_csv('  ')**

<br><br>


0. [DataFrame](https://www.geeksforgeeks.org/python-pandas-dataframe/)
> A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

1. [data.info()](https://www.geeksforgeeks.org/python-pandas-dataframe-info/)
> Pandas dataframe.info() function is used to get a concise summary of the dataframe. It comes really handy when doing exploratory analysis of the data.

2. [data.describe()](https://www.geeksforgeeks.org/python-pandas-dataframe-describe-method/)
> Pandas describe() is used to view some basic statistical details like percentile, mean, std etc. of a data frame or a series of numeric values.


3. [data.iloc[]](https://www.geeksforgeeks.org/python-pandas-series-iloc/)
> iloc attribute enables purely integer-location based indexing for selection by position over the given Series object.


4. [data.value_count()](https://www.geeksforgeeks.org/python-pandas-index-value_counts/)
>  value_counts() function to find the count of all unique values in the given index.

5. [data.isnull() / data.isna()](https://www.geeksforgeeks.org/python-pandas-isnull-and-notnull/)
> isnull() function detect missing values in the given series object. It return a boolean same-sized object indicating if the values are NA. 


6. [data.dropna()](https://www.geeksforgeeks.org/python-pandas-dataframe-dropna/#:~:text=Pandas%20dropna()%20method%20allows,Null%20values%20in%20different%20ways.&text=Parameters%3A,or%20'columns'%20for%20String.)
> Pandas dropna() method allows the user to analyze and drop Rows/Columns with Null values in different ways.

7. [data.fillna()](https://www.geeksforgeeks.org/python-pandas-dataframe-fillna-to-replace-null-values-in-dataframe/)
> fillna() manages and let the user replace NaN values with some value of their own.

8. [data.drop()](https://www.geeksforgeeks.org/drop-a-list-of-rows-from-a-pandas-dataframe/)

9. [data.where()](https://www.geeksforgeeks.org/python-pandas-dataframe-where/)
> Pandas where() method is used to check a data frame for one or more condition and return the result accordingly. By default, The rows not satisfying the condition are filled with NaN value.

10. [data.replace()](https://www.geeksforgeeks.org/python-pandas-dataframe-replace/#:~:text=replace()%20function%20is%20used,Python%20regex%20(regular%20expressions).)
> replace() function is used to replace a string, regex, list, dictionary, series, number etc. from a dataframe. 

11. [data.astype()](https://www.geeksforgeeks.org/python-pandas-dataframe-astype/#:~:text=astype()%20method%20is%20used,type%20to%20another%20data%20type.)
> astype() method is used to cast a pandas object to a specified dtype. astype() function also provides the capability to convert any suitable existing column to categorical type.

12. [data.sort_values()](https://www.geeksforgeeks.org/python-pandas-dataframe-sort_values-set-1/#:~:text=Pandas%20sort_values()%20function%20sorts,particular%20column%20cannot%20be%20selected.&text=Every%20parameter%20has%20some%20default%20values%20execept%20the%20'by'%20parameter.)
> Pandas sort_values() function sorts a data frame in Ascending or Descending order of passed Column. It's different than the sorted Python function since it cannot sort a data frame and particular column cannot be selected.

#### DataFrame

In [ ]:
l=[21,56,43,3,56,67]

pd.DataFrame(l)

    0
0  21
1  56
2  43
3   3
4  56
5  67

In [ ]:
d={'abcd':[1,2,3],'b':[1,5,3]}
pd.DataFrame(d)

   abcd  b
0     1  1
1     2  5
2     3  3

#### Importing Data

In [ ]:
import pandas as pd

data= pd.read_csv('/content/Data.csv')

In [ ]:
data.head(10)

   Country   Age   Salary Purchased  Date
0   France  44.0  72000.0        No   NaN
1    Spain  27.0  48000.0       Yes   NaN
2  Germany  30.0  54000.0        No   NaN
3    Spain  38.0  61000.0        No   NaN
4  Germany  40.0      NaN       Yes   NaN
5   France  35.0  58000.0       Yes   NaN
6    Spain   NaN  52000.0        No   NaN
7   France  48.0  79000.0       Yes   NaN
8  Germany  50.0  83000.0        No   NaN
9   France  37.0  67000.0       Yes   NaN

In [ ]:
data.tail(5)

   Country   Age   Salary Purchased  Date
5   France  35.0  58000.0       Yes   NaN
6    Spain   NaN  52000.0        No   NaN
7   France  48.0  79000.0       Yes   NaN
8  Germany  50.0  83000.0        No   NaN
9   France  37.0  67000.0       Yes   NaN

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
 4   Date       0 non-null      float64
dtypes: float64(3), object(2)
memory usage: 528.0+ bytes

In [ ]:
data.describe()

             Age        Salary  Date
count   9.000000      9.000000   0.0
mean   38.777778  63777.777778   NaN
std     7.693793  12265.579662   NaN
min    27.000000  48000.000000   NaN
25%    35.000000  54000.000000   NaN
50%    38.000000  61000.000000   NaN
75%    44.000000  72000.000000   NaN
max    50.000000  83000.000000   NaN

In [ ]:
data.iloc[2:7]

   Country   Age   Salary Purchased  Date
2  Germany  30.0  54000.0        No   NaN
3    Spain  38.0  61000.0        No   NaN
4  Germany  40.0      NaN       Yes   NaN
5   France  35.0  58000.0       Yes   NaN
6    Spain   NaN  52000.0        No   NaN

In [ ]:
data.iloc[:,3]

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [ ]:
data.iloc[2:7,1:3]

    Age   Salary
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0

In [ ]:
data['Purchased'].value_counts()

Yes    5
No     5
Name: Purchased, dtype: int64